"use client";

import Head from "next/head";
import AppLayout from "../components/layout/AppLayout";
import Footer from "../components/common/Footer";

const TermsOfService = () => {
  return (
    <>
      <AppLayout>
        <Head>
          <title>Договір публічної оферти</title>
          <meta name="description" content="Договір публічної оферти" />
        </Head>
        <main>
          <h1>Договір публічної оферти</h1>
          <section>
            <h2>1. Предмет договору</h2>
            <p>
              1.1. Продавець надає Покупцеві можливість отримати доступ до
              платних відео-тренувань на сайті{" "}
              <a href="https://nemarafon.vercel.app">
                https://nemarafon.vercel.app
              </a>
              .
            </p>
            <h2>2. Умови доступу</h2>
            <p>
              2.1. Доступ до платних відео-тренувань надається виключно на
              тимчасове користування, відповідно до цього Договору та умов,
              встановлених на сайті{" "}
              <a href="https://nemarafon.vercel.app">
                https://nemarafon.vercel.app
              </a>
              .
            </p>
            <p>
              2.2. Для отримання доступу Покупець повинен пройти реєстрацію на
              сайті та оплатити послугу відповідно до ціни, встановленої на
              сайті.
            </p>
            <h2>3. Ціна та умови оплати</h2>
            <p>
              3.1. Ціна на доступ до платних відео-тренувань встановлюється
              Продавцем та відображається на сайті.
            </p>
            <p>
              3.2. Оплата здійснюється Покупцем відповідно до умов та цін,
              встановлених на сайті.
            </p>
            <h2>4. Права та обов'язки сторін</h2>
            <p>
              4.1. Продавець зобов'язується забезпечувати Покупця доступом до
              платних відео-тренувань на сайті{" "}
              <a href="https://nemarafon.vercel.app">
                https://nemarafon.vercel.app
              </a>{" "}
              відповідно до умов цього Договору.
            </p>
            <p>
              4.2. Покупець зобов'язується використовувати платні
              відео-тренування тільки для особистих потреб відповідно до умов
              цього Договору та умов, встановлених на сайті.
            </p>
            <h2>5. Термін дії договору</h2>
            <p>
              5.1. Цей Договір вступає в дію з моменту оплати Покупцем платної
              послуги та діє до моменту виконання усіх зобов'язань сторонами.
            </p>
            <h2>6. Реклама</h2>
            <p>
              6.1. Покупець погоджується, що він не має права використовувати
              матеріали з платних відео-тренувань для рекламних цілей без
              додаткової домовленості з Продавцем.
            </p>
            <h2>7. Відповідальність сторін</h2>
            <p>
              7.1. Сторони несуть відповідальність за невиконання умов цього
              Договору відповідно до законодавства України.
            </p>
            <p>
              7.2. Продавець не несе відповідальності за неправильне
              використання Покупцем платних відео-тренувань.
            </p>
            <p>
              7.3. Покупець несе відповідальність за збереження конфіденційності
              даних, отриманих від Продавця в процесі використання платних
              відео-тренувань.
            </p>
            <h2>8. Зміна умов договору</h2>
            <p>
              8.1. Продавець має право вносити зміни до умов даного Договору.
              Про внесення змін Продавець повідомляє Покупця на відповідній
              розділ з контактами, або веб форму для зв'язку на сайті{" "}
              <a href="https://nemarafon.vercel.app">
                https://nemarafon.vercel.app
              </a>{" "}
              або на відповідну електронну адресу.
            </p>
            <h2>9. Розрив договору</h2>
            <p>
              9.1. Даний Договір може бути розірваний без визнання
              відповідальності будь-якої із сторін в будь-який час за угодою
              сторін.
            </p>
            <p>
              9.2. У випадку порушення Покупцем умов даного Договору, Продавець
              має право відмовитися від дальнішого надання послуг Покупцеві без
              визнання відповідальності та без повернення вартості платежу.
            </p>
            <p>
              9.3. Договір може бути розірваний без визнання відповідальності
              однією з Сторін в будь-який момент через надання письмової відмови
              другій Стороні.
            </p>
            <p>
              9.4. Договір також може бути розірваний в разі невиконання
              будь-якої з Сторін обов'язків.
            </p>
            <p>
              9.5. При розірванні Договору, сторони не зобов'язані повернути
              одна одній всі взаємодійні платежі.
            </p>
            <p>
              9.6. Розірвання Договору відміняє відповідальність Сторін за
              надання взаємодійних платежів.
            </p>
            <h2>10. Вирішення спорів</h2>
            <p>
              10.1. Всі спори, які виникають в результаті виконання даного
              Договору, будуть розв'язуватися споречними засобами законодавства
              України.
            </p>
            <h2>11. Кінцеві умови</h2>
            <p>
              11.1. Даний Договір становить єдиний та повний документ, який
              регулює взаємодію між Сторонами.
            </p>
            <p>
              11.2. Усі попередні договори, узгодження та пред'явлення, які
              відносяться до предмету даного Договору, а також усі повідомлення,
              пред'явлення та доповіді здійснюються в письмовій формі.
            </p>
            <p>
              11.3. Договір публічної оферти є публічним, тобто відповідно до
              статей 633, 641 Цивільного кодексу України, його умови однакові
              для всіх Покупців незалежно від статусу (фізична особа, юридична
              особа, фізична особа-підприємець).
            </p>
            <p>
              11.4. Даний Договір є нерозірвним та діє на протязі всього періоду
              надання послуг Продавцем Покупцеві.
            </p>
            <p>
              11.5. Усі зміни та доповнення, які робляться до даного Договору, є
              дієздатними тільки в тому випадку, якщо вони відбуваються в
              письмовій формі та затверджені обома Сторонами.
            </p>
            <p>
              11.6. Договір може бути розірваний без визнання відповідальності
              однією з Сторін в будь-який момент через надання письмової відмови
              другій Стороні.
            </p>
            <p>
              11.7. Покупець зобов'язується забезпечити достовірність та
              правдивість відомостей, наданих при реєстрації на сайті.
            </p>
            <p>
              11.8. Покупець не має права передавати свої права та обов'язки за
              даним договором третім особам без попередньої згоди Продавця.
            </p>
            <p>
              11.9. Продавець не несе відповідальності за несправність технічних
              засобів Покупця, які використовуються для доступу до сайту.
            </p>
            <h2>12. Встановлення та збереження Договору</h2>
            <p>
              12.1. Даний Договір зберігається в електронному вигляді в архіві
              Продавця.
            </p>
            <h2>13. Додаткові умови</h2>
            <p>
              13.1. Додаткові умови, які не відомі на момент підписання даного
              Договору, можуть бути додані до нього після його підписання у
              вигляді додаткових угод, які підписуються обома Сторонами в
              письмовій формі.
            </p>
            <p>
              13.2. У випадку несумісності між Договором та додатковими угодами,
              перевага надається додатковим угодам.
            </p>
            <h2>14. Відповідальність сторін</h2>
            <p>
              14.1. Продавець несе відповідальність за надання Покупцеві послуг,
              які відповідають вимогам, встановленим у Договорі.
            </p>
            <p>
              14.2. Покупець несе відповідальність за оплату послуг, наданих
              Продавцем, відповідно до умов Договору.
            </p>
            <h2>15. Захист персональних даних</h2>
            <p>
              15.1. Сторони зобов'язані дотримуватися відповідних законів про
              захист персональних даних.
            </p>
            <p>
              15.2. Продавець зобов'язаний використовувати персональні дані
              Покупця тільки для виконання умов Договору.
            </p>
            <h2>16. Рішення спорів</h2>
            <p>
              16.1. Усі спори, які можуть виникнути в ході виконання Договору,
              Сторони зобов'язані спробувати урегулювати.
            </p>
            <p>
              16.2. Якщо спори не можуть бути урегульовані шляхом переговорів,
              спори будуть передані на розгляд суду.
            </p>
            <h2>17. Закінчення Договору</h2>
            <p>
              17.1. Договір вважається закінченим після повного виконання
              Сторонами усіх зобов'язань, передбачених Договором.
            </p>
            <p>
              17.2. Продавець має право розірвати Договір в будь-який час без
              попереднього повідомлення Покупцеві, якщо Покупець порушує умови
              Договору.
            </p>
            <h2>18. Додаткові умови</h2>
            <p>
              18.1. Додаткові умови Договору вносяться в Договір в письмовій
              формі та є невід'ємною частиною Договору.
            </p>
            <p>
              18.2. Якщо якісь положення Договору суперечать законодавству, то
              такі положення встановлюються відповідно до законодавства.
            </p>
            <h2>19. Зміна умов Договору</h2>
            <p>
              19.1. Умови Договору можуть бути змінені та/або доповнені
              Продавцем без попереднього повідомлення Покупця. Нові умови
              Договору набувають чинності з моменту їх опублікування на
              веб-сайті Продавця. При відсутності протесту Покупця протягом
              одного тижня від дати опублікування нових умов, вважається, що
              Покупець погодився з ними.
            </p>
            <h2>20. Реклама</h2>
            <p>
              20.1. Покупець погоджується, що Продавець може використовувати
              його ім'я та зображення для рекламних цілей на своїх веб-сайтах та
              в соціальних медіа.
            </p>
            <p>
              20.2. Покупець зобов'язується відмовитися від використання
              матеріалів, які рекламують товари та послуги Продавця, в якості
              рекламного матеріалу інших товарів та послуг.
            </p>
            <p>
              20.3. Продавець залишає за собою право на використання імені,
              логотипу, фотографій та інших рекламних матеріалів Покупця в цілях
              реклами своїх товарів та послуг.
            </p>
            <p>
              20.4. Покупець не має права на використання матеріалів, які
              рекламують товари та послуги Продавця, в якості рекламного
              матеріалу інших товарів та послуг.
            </p>
            <h2>21. Резолютивні способи розрізнення справ</h2>
            <p>
              21.1. Усі суперечки, які виникають в зв'язку з Договором, Сторони
              зобов'язуються вирішувати шляхом переговорів.
            </p>
            <p>
              21.2. Якщо суперечка не може бути вирішена шляхом переговорів,
              спори подаються до суду відповідно до законодавства України.
            </p>
            <p>
              21.3. Продавець залишає за собою право відмовитися від виконання
              даного Договору в будь-який час без винятку та без повідомлення.
            </p>
            <h2>22. ВІДШКОДУВАННЯ КОШТІВ</h2>
            <p>
              22.1. У разі, якщо Покупець не задоволений якістю отриманих
              послуг, він має право на повернення коштів протягом 14 календарних
              днів з моменту оплати послуги за умови, що Покупець не
              користувався наданими матеріалами.
            </p>
            <p>
              22.2. Для ініціації повернення коштів Покупець повинен звернутися
              до Продавця через Instagram або Telegram, що зазначені на цьому
              сайті, або через електронну скриньку за адресою:
              butenkonastia2603@gmail.com.
            </p>
            <p>
              22.3. Повернення коштів здійснюється Продавцем протягом 7 робочих
              днів після підтвердження права Покупця на повернення коштів.
            </p>
            <p>
              22.4. Повернення коштів здійснюється виключно на той платіжний
              засіб, який був використаний Покупцем при оплаті послуги.
            </p>
            <h2>23. Заключні положення</h2>
            <p>
              23.1. Договір складено у двох цифрових екземплярах, по одному для
              кожної сторони.
            </p>
            <p>
              23.2. Покупець виступає в якості власника інтелектуальної
              власності на відео-тренування, надані йому на платній основі, з
              метою власного використання в особистих та некомерційних цілях.
            </p>
            <p>
              23.3. У випадку порушення Покупцем вимог даного Договору,
              Продавець залишає за собою право відмовити в наданні доступу до
              відео-тренувань та/або відшкодувати збитки, завдані Покупцем.
            </p>
            <p>
              23.4. Договір діє з моменту оплати Покупцем відео-тренувань і діє
              до моменту виконання усіх зобов'язань або розірвання договору.
            </p>
            <p>
              23.5. Договір набуває сили з моменту оплати покупцем доступу до
              платних відео-тренувань.
            </p>
            <h2>24. ЮРИДИЧНА АДРЕСА ПРОДАВЦЯ</h2>
            23.1. Юридична адреса: Україна, 10036, Дніпропетровська обл.,
            Нікопольський р-н, селище міського типу Томаківка, вул. 40 років
            перемоги, буд. 45.
          </section>
        </main>
        <style jsx>{`
          main {
            padding: 20px;
            max-width: 800px;
            margin: 20px auto;
          }
          h1,
          h2 {
            margin-top: 20px;
            margin-bottom: 10px;
            color: #fff;
          }
          h2 {
            text-align: left;
            font-size: 18px;
          }
          p {
            margin-top: 0;
            margin-bottom: 10px;
            line-height: 1.6;
          }
          a {
            text-decoration: underline;
          }
        `}</style>
        <Footer />
      </AppLayout>
    </>
  );
};

export default TermsOfService;
